analyze -library WORK -format vhdl { syn/constants.vhd }
analyze -library WORK -format vhdl { syn/registerfile.vhd }
analyze -library WORK -format vhdl { syn/RML.vhd }
analyze -library WORK -format vhdl { syn/RMLwithRF.vhd }

elaborate RMLWITHRF -architecture STRUCTURAL -parameters "NGlobal = 5, NBlockRegs = 4, NWindows = 5, NData = 8"
compile

report_timing > syn/reports/RMLwithRF_timing.rpt

write -hierarchy -format vhdl -output syn/RMLwithRF_syn.vhdl
